clc
clear all
close all

load_left = [   0    0     0     0     0     8     8     8     8     8    16    16    16    16    16    24    24    24    24    24    32    32     32    32    32] * 1000;
load_right = [  0    8    16    24    32     0     8    16    24    32     0     8    16    24    32     0     8    16    24    32     0     8     16    24    32] * 1000;
g = 9.8;
%Y 是theta X是位移
%X 是观测的偏移量
Y1=[0
    0.78985
0.79205
0.7961
0.9263
1.8653
1.4866
1.3419
1.1479
1.03535
2.5128
2.0262
1.83595
1.6483
1.5957
3.47095
2.65655
2.3187
2.26545
2.34115
3.75225
3.17495
3.07975
2.9449
2.66685];

Y2=[0
    1.784
2.5464
2.7965
3.9098
0.48625
1.38565
2.03665
2.67935
3.3196
0.53735
1.1727
1.95345
2.52235
3.1807
0.67885
1.0409
1.73215
2.1778
3.05055
0.7691
0.93625
1.6865
1.88305
2.9003];

X1=-[0
    -0.0035
0.002
0.0015
0.013
-0.0485
-0.0375
-0.0335
-0.027
-0.0225
-0.0665
-0.054
-0.0485
-0.043
-0.041
-0.092
-0.0715
-0.063
-0.0615
-0.0625
-0.102
-0.0855
-0.083
-0.0795
-0.0735];

X2=-[0
    -0.0405
-0.0615
-0.0685
-0.0975
0.006
-0.029
-0.048
-0.0655
-0.082
0.012
-0.0225
-0.046
-0.0615
-0.0785
0.0175
-0.0195
-0.04
-0.052
-0.0755
0.021
-0.016
-0.038
-0.0435
-0.0715];


idx = find(load_left < load_right);
for i = 1 : length(idx)
    % load交换
    tmp = load_left(idx(i));
    load_left(idx(i)) = load_right(idx(i));
    load_right(idx(i)) = tmp;

    % Y1,Y2交换
    tmp = Y1(idx(i));
    Y1(idx(i)) = Y2(idx(i));
    Y2(idx(i)) = tmp;

    % X1,X2交换
    tmp = X1(idx(i));
    X1(idx(i)) = X2(idx(i));
    X2(idx(i)) = tmp;
end




load k.mat
min_load = min(load_left,load_right)
% X1=X1-load_left.'*g/K_estimated
% X2=X2-load_right.'*g/K_estimated


% X1=X1-min_load.'*g/K_estimated
% 这里很重要！
X2=X2+ (load_left-load_right).'*g/K_estimated


%% 计算左测
lm = fitlm([X1], [Y1]);  %36 左传感器的theta
disp(lm);
output_fit_result([X1], [Y1])


lm = fitlm([X2], [Y2]); %22   右传感器的theta
disp(lm);
output_fit_result([X2], [Y2])

