
clc
clear all
close all
rng(0);

load_left =  [   0      0     0     0     0     8     8     8     8     8    16    16    16    16    16    24    24    24    24    24    32    32     32    32    32] ;
load_right = [  0     8    16    24    32     0     8    16    24    32     0     8    16    24    32     0     8    16    24    32     0     8     16    24    32] ;
diff_left = -[  0         -0.0035    0.0020    0.0015    0.0130   -0.0485   -0.0375   -0.0335   -0.0270   -0.0225   -0.0665   -0.0540   -0.0485    -0.0430   -0.0410   -0.0920   -0.0715   -0.0630   -0.0615   -0.0625   -0.1020   -0.0855   -0.0830   -0.0795   -0.0735];
diff_right= -[   0       -0.0405   -0.0615   -0.0685   -0.0975    0.0060   -0.0290   -0.0480   -0.0655   -0.0820    0.0120   -0.0225   -0.0460    -0.0615   -0.0785    0.0175   -0.0195   -0.0400   -0.0520   -0.0755    0.0210   -0.0160   -0.0380   -0.0435   -0.0715];
diff_degree_left = [0.000000  0.789850  0.792050  0.796100  0.926300  1.865300  1.486600  1.341900  1.147900  1.035350  2.512800  2.026200  1.835950  1.648300  1.595700  3.470950  2.656550  2.318700  2.265450  2.341150  3.752250  3.174950  3.079750  2.944900  2.666850];
diff_degree_right = [0.000000   1.784000   2.546400   2.796500   3.909800   0.486250   1.385650   2.036650   2.679350   3.319600   0.537350   1.172700   1.953450   2.522350   3.180700   0.678850   1.040900   1.732150   2.177800   3.050550   0.769100   0.936250   1.686500   1.883050   2.900300];



% 确保左边更重
idx = find(load_left < load_right);
for i = 1 : length(idx)
    % 修改重量
    tmp = load_left(idx(i));
    load_left(idx(i)) = load_right(idx(i));
    load_right(idx(i)) = tmp;

    % 交换z的变化量
    tmp = diff_left(idx(i));
    diff_left(idx(i)) = diff_right(idx(i));
    diff_right(idx(i)) = tmp;

    % 交换degree的变化量
    tmp = diff_degree_left(idx(i));
    diff_degree_left(idx(i)) = diff_degree_right(idx(i));
    diff_degree_right(idx(i)) = tmp;
end

inputs = [load_left; load_right];  %单位吨
targets = [diff_left; diff_right]; %单位cm
targets_left =diff_left;
targets_right =diff_right;